namespace API.Helpers
{
    public class PaginationParams
    {
        /*
        كل ما نحتاجه من المستخدم يحدد لنا اثنين برميترات
        رقم الصفحة التي يريد جلب عناصرها
        و وكم عدد العناصر المطلوب فيها
        */
         public int  PageIndex { get; set; } = 1; // هذا رقم الصفحة اللي بايكون واجي من الكلاينت والافتراضي الاولى

        private const int MaxPageSize = 50; // هنا نحدد متغير برايفت نحدد فيه اعلى رقم ممكن تحتوية الصفحة الواحدة من عناصر
        private int _pageSize = 10;  // هنا متغير برايفت لكم عناصر بالصفحة والافتراضي عشرة

        public int PageSize // هنا دالتي جت وست حيث بالجلب سيخذ قيمة المتغير البرايفت
        {
            get => _pageSize;
            // بالتعيين سنتحقق لو قيمة العنصر المبعوثة من الكلاينت اكبر من خمسين يرجع لنا الخمسين
            // مالم يرجع قيمة العنصر المبعوثة لعدد العناصر بالصفحة
            set => _pageSize = (value > MaxPageSize) ? MaxPageSize : value;
        }


    }
}

 